# Data Cleaning and Describing

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os

### Dataset: vehicle_population

In [3]:
# Import vehicle_population.csv
path=r'/Users/elvachen/Documents/DA Learning/Immersion-Exercise/6/2original data'
df_vp=pd.read_csv(os.path.join(path,'vehicle_population.csv'),index_col = False)
df_vp.head(10)

   Unnamed: 0  year   county        fuel_type   make     model  num_vehicle
0           0  2010  Alameda           Diesel    NaN       NaN        10939
1           1  2010  Alameda         Electric   Ford    Ranger            3
2           2  2010  Alameda         Electric  Tesla  Roadster           17
3           3  2010  Alameda        Flex Fuel    NaN       NaN        10974
4           4  2010  Alameda         Gasoline    NaN       NaN       840577
5           5  2010  Alameda  Gasoline Hybrid    NaN       NaN        22720
6           6  2010  Alameda      Natural Gas    NaN       NaN          173
7           7  2010  Alameda          Propane    NaN       NaN           19
8           8  2010   Alpine           Diesel    NaN       NaN           73
9           9  2010   Alpine        Flex Fuel    NaN       NaN           16

In [10]:
# Check missing values
df_vp['year'].value_counts(dropna = False)

2021    4087
2020    3295
2019    2907
2018    2596
2017    2242
2016    1701
2015    1384
2014    1181
2013     941
2012     669
2011     489
2010     395
Name: year, dtype: int64

In [11]:
# Check missing values
df_vp['county'].value_counts(dropna = False)

Los Angeles        636
Orange             592
Santa Clara        577
San Mateo          551
San Diego          546
Alameda            546
Contra Costa       538
San Francisco      537
Sacramento         535
Ventura            533
Riverside          529
San Bernardino     520
Sonoma             519
Santa Barbara      518
Marin              515
Out Of State       515
Placer             506
Santa Cruz         483
Kern               480
Yolo               479
Solano             475
Fresno             474
Monterey           473
San Luis Obispo    471
San Joaquin        467
Napa               465
El Dorado          453
Stanislaus         431
Tulare             400
Humboldt           370
Mendocino          363
Nevada             355
Butte              349
Merced             340
San Benito         340
Shasta             337
Madera             329
Imperial           297
Calaveras          295
Kings              282
Lake               281
Tuolumne           277
Sutter             276
Yuba               271
Amador             269
Siskiyou           218
Tehama             203
Del Norte          183
Mariposa           179
Inyo               173
Plumas             167
Glenn              157
Mono               151
Trinity            145
Colusa             139
Lassen             131
Alpine              93
Modoc               78
Sierra              75
Name: county, dtype: int64

In [12]:
# Check missing values
df_vp['fuel_type'].value_counts(dropna = False)

PHEV               9621
Electric           7801
Diesel              708
Flex Fuel           708
Gasoline            708
Gasoline Hybrid     708
Natural Gas         601
Propane             594
Hydrogen            346
Hydrogen             92
Name: fuel_type, dtype: int64

In [13]:
# Check missing values
df_vp['make'].value_counts(dropna = False)

NaN               3689
BMW               1871
Ford              1720
Tesla             1532
Toyota            1479
Chevrolet         1315
Honda             1126
Hyundai            927
Kia                828
Mercedes- Benz     757
Volvo              673
Porsche            638
Nissan             571
Audi               557
Mitsubishi         470
Smart              413
FIAT               398
Cadillac           383
Volkswagen         359
                   338
Fisker             271
MINI               248
Chrysler           247
Mercedes-Benz      192
Subaru             154
Land Rover         136
Jaguar             124
Lincoln             88
McLaren             64
Karma               58
Polestar            53
Jeep                50
Mazda               21
Rivian              20
Bentley             17
Azure Dynamics      17
Think Global        16
Coda                15
Scion               14
Ferrari             14
Lucid               13
Kewet                5
GMC                  4
Kubvan               2
Name: make, dtype: int64

In [14]:
# Check missing values
df_vp['model'].value_counts(dropna = False)

NaN                     3689
Volt                     608
LEAF                     571
Prius Plug-in Hybrid     549
Model S                  493
                        ...
Kewet                      5
Ev1                        4
Model 70                   2
C40                        1
Fcx                        1
Name: model, Length: 119, dtype: int64

In [15]:
# Check missing values
df_vp['num_vehicle'].value_counts(dropna = False)

1        3063
2        1608
3        1011
4         789
5         690
         ...
3977        1
86222       1
5214        1
2117        1
50112       1
Name: num_vehicle, Length: 3668, dtype: int64

In [24]:
# Check data types of each columns
df_vp.dtypes

year            int64
county         object
fuel_type      object
make           object
model          object
num_vehicle     int64
dtype: object

In [25]:
# Describe the column 'num_vehicle'
df_vp['num_vehicle'].describe()

count    2.188700e+04
mean     1.410416e+04
std      1.649749e+05
min      1.000000e+00
25%      3.000000e+00
50%      1.800000e+01
75%      1.660000e+02
max      6.287010e+06
Name: num_vehicle, dtype: float64

In [32]:
df_vp['make'].value_counts(dropna = False)

NaN               3689
BMW               1871
Ford              1720
Tesla             1532
Toyota            1479
Chevrolet         1315
Honda             1126
Hyundai            927
Kia                828
Mercedes- Benz     757
Volvo              673
Porsche            638
Nissan             571
Audi               557
Mitsubishi         470
Smart              413
FIAT               398
Cadillac           383
Volkswagen         359
                   338
Fisker             271
MINI               248
Chrysler           247
Mercedes-Benz      192
Subaru             154
Land Rover         136
Jaguar             124
Lincoln             88
McLaren             64
Karma               58
Polestar            53
Jeep                50
Mazda               21
Rivian              20
Bentley             17
Azure Dynamics      17
Think Global        16
Coda                15
Scion               14
Ferrari             14
Lucid               13
Kewet                5
GMC                  4
Kubvan               2
Name: make, dtype: int64

### Dataset: new_zev_sales

In [37]:
# Import new_zev_sales.csv
path=r'/Users/elvachen/Documents/DA Learning/Immersion-Exercise/6/2original data'
df_zev=pd.read_csv(os.path.join(path,'new_zev_sales.csv'),index_col = False)
df_zev.head(10)

   year          county fuel_type  make   model  num_vehicle
0  1998     Los Angeles  Electric  FORD  RANGER            1
1  1998          Orange  Electric  FORD  RANGER            1
2  1998  San Bernardino  Electric  FORD  RANGER            2
3  1998       San Mateo  Electric  FORD  RANGER            1
4  1999   Santa Barbara  Electric  FORD  RANGER            1
5  2000    Out Of State  Electric  FORD  RANGER            2
6  2001     Los Angeles  Electric  FORD  RANGER            1
7  2002          Tulare  Electric  FORD  RANGER            1
8  2002         Ventura  Electric  FORD  RANGER            2
9  2003          Placer  Electric  FORD  RANGER            2

In [38]:
# Check missing values
df_zev['year'].value_counts(dropna = False)

2021    2436
2022    1936
2020    1813
2019    1613
2018    1547
2017    1367
2016    1023
2015     843
2014     766
2013     520
2012     332
2011     122
2010      47
2009      22
2005       5
1998       4
2003       3
2002       2
1999       1
2006       1
2004       1
2001       1
2000       1
Name: year, dtype: int64

In [39]:
# Check missing values
df_zev['county'].value_counts(dropna = False)

Los Angeles        538
Orange             513
San Diego          479
Santa Clara        467
Alameda            458
Contra Costa       449
San Mateo          446
Riverside          444
San Francisco      437
Ventura            427
San Bernardino     426
Sacramento         412
Marin              400
Sonoma             389
Santa Barbara      376
Out Of State       363
Placer             360
Solano             348
Fresno             348
Santa Cruz         343
San Joaquin        340
Monterey           331
San Luis Obispo    329
Kern               327
Yolo               325
El Dorado          319
Napa               302
Stanislaus         281
Tulare             235
Nevada             220
Humboldt           214
Butte              211
Merced             207
Mendocino          203
Shasta             183
San Benito         178
Madera             167
Imperial           143
Calaveras          140
Lake               139
Sutter             134
Kings              130
Yuba               116
Tuolumne           115
Amador             106
Tehama              88
Mariposa            65
Inyo                58
Siskiyou            57
Glenn               53
Del Norte           52
Mono                50
Plumas              50
Trinity             35
Colusa              30
Lassen              21
Alpine              19
Sierra               6
Modoc                4
Name: county, dtype: int64

In [40]:
# Check missing values
df_zev['make'].value_counts(dropna = False)

BMW              1692
TESLA            1176
Toyota           1093
FORD             1090
CHEVROLET        1025
Hyundai           964
Kia               752
Volvo             715
HONDA             629
Audi              572
Mercedes-Benz     555
Porsche           501
NISSAN            485
Volkswagen        367
FIAT              282
Chrysler          247
Mitsubishi        240
MINI              229
Smart             222
Tesla             188
Subaru            169
Land Rover        128
Cadillac          122
Jaguar            122
Lincoln           112
Ford              106
Jeep               93
Chevrolet          84
Polestar           83
Nissan             45
Honda              45
Mazda              42
Rivian             42
Fisker             38
Lucid              34
Karma              33
Lexus              28
Ferrari            25
Bentley            12
McLaren            12
GMC                 5
Scion               2
Name: make, dtype: int64

In [41]:
# Check missing values
df_zev['model'].value_counts(dropna = False)

VOLT                  519
Model S               507
LEAF                  485
Fusion Energi         410
Prius Prime           356
                     ...
SF90 Spider             4
FCX                     3
iQ EV                   2
e-tron S                1
e-tron S Sportback      1
Name: model, Length: 120, dtype: int64

In [42]:
# Check missing values
df_zev['num_vehicle'].value_counts(dropna = False)

1       3031
2       1499
3        935
4        731
5        601
        ...
1462       1
1412       1
629        1
655        1
484        1
Name: num_vehicle, Length: 814, dtype: int64

In [60]:
# Check the number of distinct values in each column
df_zev['num_vehicle'].nunique()

814

In [66]:
# Describe the column 'num_vehicle'
df_zev['num_vehicle'].describe()

count    14406.000000
mean        78.813480
std        423.480453
min          1.000000
25%          2.000000
50%          6.000000
75%         31.000000
max      17977.000000
Name: num_vehicle, dtype: float64

### Dataset: ldv_sales_shares

In [67]:
# Import ldv_sales_shares.csv
path=r'/Users/elvachen/Documents/DA Learning/Immersion-Exercise/6/2original data'
df_ldv=pd.read_csv(os.path.join(path,'ldv_sales_shares.csv'),index_col = False)
df_ldv.head(10)

      period        county  sales sales_share
0  2021Q1tQ3       Alameda  54557         21%
1  2021Q1tQ3        Alpine     63         14%
2  2021Q1tQ3        Amador    994          5%
3  2021Q1tQ3         Butte   5018          6%
4  2021Q1tQ3     Calaveras   1398          5%
5  2021Q1tQ3        Colusa    610          2%
6  2021Q1tQ3  Contra Costa  42494         17%
7  2021Q1tQ3     Del Norte    434          2%
8  2021Q1tQ3     El Dorado   6487         11%
9  2021Q1tQ3        Fresno  28622          6%

In [68]:
# Check missing values
df_ldv['period'].value_counts(dropna = False)

2021Q1tQ3    59
2022Q1       59
Name: period, dtype: int64

In [69]:
# Check missing values
df_ldv['county'].value_counts(dropna = False)

Alameda            2
Santa Cruz         2
Plumas             2
Riverside          2
Sacramento         2
San Benito         2
San Bernardino     2
San Diego          2
San Francisco      2
San Joaquin        2
San Luis Obispo    2
San Mateo          2
Santa Barbara      2
Santa Clara        2
Shasta             2
Out Of State       2
Sierra             2
Siskiyou           2
Solano             2
Sonoma             2
Stanislaus         2
Sutter             2
Tehama             2
Trinity            2
Tulare             2
Tuolumne           2
Ventura            2
Yolo               2
Placer             2
Orange             2
Alpine             2
Kern               2
Amador             2
Butte              2
Calaveras          2
Colusa             2
Contra Costa       2
Del Norte          2
El Dorado          2
Fresno             2
Glenn              2
Humboldt           2
Imperial           2
Inyo               2
Kings              2
Nevada             2
Lake               2
Lassen             2
Los Angeles        2
Madera             2
Marin              2
Mariposa           2
Mendocino          2
Merced             2
Modoc              2
Mono               2
Monterey           2
Napa               2
Yuba               2
Name: county, dtype: int64

In [74]:
# Check missing values
df_ldv['sales_share'].value_counts(dropna = False)

5%       9
2%       6
6%       5
4%       4
11%      4
        ..
3.51%    1
7.60%    1
6.69%    1
5.31%    1
7.42%    1
Name: sales_share, Length: 77, dtype: int64

In [75]:
# Check data types
df_ldv.dtypes

period         object
county         object
sales           int64
sales_share    object
dtype: object

In [78]:
# Count the number of distinct values in each column
df_ldv['sales_share'].nunique()

77

In [81]:
# Describe the dataset
df_ldv.describe()

               sales
count     118.000000
mean    18062.576271
std     50147.743077
min        12.000000
25%       662.750000
50%      3286.000000
75%     13207.000000
max    465295.000000

In [92]:
# Remove '%' from column 'sales_share'
df_ldv['sales_share']=df_ldv['sales_share'].str.replace('%','')
df_ldv['sales_share'].value_counts(dropna = False)

5       9
2       6
6       5
4       4
11      4
       ..
3.51    1
7.60    1
6.69    1
5.31    1
7.42    1
Name: sales_share, Length: 77, dtype: int64

In [93]:
# Change the data type of column 'sales_share'
df_ldv['sales_share'] = df_ldv['sales_share'].astype('float')
df_ldv['sales_share'].dtype

dtype('float64')

In [94]:
# Convert the column 'sales_share' to current fraction
df_ldv['sales_share']=df_ldv['sales_share']/100
df_ldv['sales_share'].value_counts(dropna = False)

0.0500    9
0.0200    6
0.0600    5
0.0400    4
0.1100    4
         ..
0.0351    1
0.0760    1
0.0669    1
0.0531    1
0.0742    1
Name: sales_share, Length: 76, dtype: int64

In [95]:
# Describe the column 'sales_share'
df_ldv['sales_share'].describe()

count    118.000000
mean       0.096574
std        0.070617
min        0.000000
25%        0.050000
50%        0.072650
75%        0.134425
max        0.337500
Name: sales_share, dtype: float64

### Dataset: ev_chargers

In [96]:
# Import ev_chargers.csv
path=r'/Users/elvachen/Documents/DA Learning/Immersion-Exercise/6/2original data'
df_charger=pd.read_csv(os.path.join(path,'ev_chargers.csv'),index_col = False)
df_charger.head(10)

,county,public_level1,shared_private_level1,public_level2,shared_private_level2,public_dc_fast,shared_private_dc_fast,total
0,Alameda,6,70,1671,1583,332,35,3697
1,Alpine,0,0,14,0,0,0,14
2,Amador,0,0,25,6,8,0,39
3,Butte,6,0,41,23,24,0,94
4,Calaveras,0,2,7,0,12,0,21
5,Colusa,0,0,18,2,18,0,38
6,Contra Costa,3,2,600,599,245,2,1451
7,Del Norte,0,0,12,0,17,0,29
8,El Dorado,1,0,124,5,49,0,179
9,Fresno,8,1,574,329,208,13,1133

In [97]:
# Check missing values
df_charger['county'].value_counts(dropna = False)

Alameda            1
Alpine             1
Riverside          1
Sacramento         1
San Benito         1
San Bernardino     1
San Diego          1
San Francisco      1
San Joaquin        1
San Luis Obispo    1
San Mateo          1
Santa Barbara      1
Santa Clara        1
Santa Cruz         1
Shasta             1
Sierra             1
Siskiyou           1
Solano             1
Sonoma             1
Stanislaus         1
Sutter             1
Tehama             1
Trinity            1
Tulare             1
Tuolumne           1
Unknown            1
Ventura            1
Yolo               1
Yuba               1
Plumas             1
Placer             1
Orange             1
Kern               1
Amador             1
Butte              1
Calaveras          1
Colusa             1
Contra Costa       1
Del Norte          1
El Dorado          1
Fresno             1
Glenn              1
Humboldt           1
Imperial           1
Inyo               1
Kings              1
Nevada             1
Lake               1
Lassen             1
Los Angeles        1
Madera             1
Marin              1
Mariposa           1
Mendocino          1
Merced             1
Modoc              1
Mono               1
Monterey           1
Napa               1
Total              1
Name: county, dtype: int64

In [101]:
# Drop the irrelevant columns
df_charger=df_charger.drop(columns=['public_level1','shared_private_level1','public_level2','shared_private_level2','public_dc_fast','shared_private_dc_fast'])
df_changer.head(5)

NameError: name 'df_changer' is not defined

In [104]:
# Describe the column 'total'
df_charger.describe()

             total
count     60.00000
mean    2634.10000
std    10664.77489
min        1.00000
25%       32.00000
50%      150.50000
75%      752.75000
max    79023.00000

### Dataset: cal_population

In [4]:
# Import cal_population.csv
path=r'/Users/elvachen/Documents/DA Learning/Immersion-Exercise/6/2original data'
df_cp=pd.read_csv(os.path.join(path,'cal_population.csv'),index_col = False)
df_cp.head()

    county  year  population
0  Alameda  2010     1512986
1  Alameda  2011     1530915
2  Alameda  2012     1553764
3  Alameda  2013     1579593
4  Alameda  2014     1607792

In [5]:
# Check data type of the dataset
df_cp.dtypes

county        object
year           int64
population     int64
dtype: object

In [125]:
# Change the data type of column population
df_cp['population']=df_cp['population'].str.replace(',','')
df_cp['population'] = df_cp['population'].astype('int64')
df_cp['population'].dtype

dtype('int64')

In [7]:
# Describe the dataset
df_cp['population'].describe()

count    6.960000e+02
mean     6.679878e+05
std      1.441978e+06
min      1.047000e+03
25%      4.532575e+04
50%      1.815020e+05
75%      7.203420e+05
max      1.010571e+07
Name: population, dtype: float64

### Dataset: gasoline_diesel

In [5]:
# Import gasoline_diesel.csv
path=r'/Users/elvachen/Documents/DA Learning/Immersion-Exercise/6/2original data'
df_gd=pd.read_csv(os.path.join(path,'gasoline_diesel.csv'),index_col = False)
df_gd.head(10)

                date  year  gasoline_price  diesel_price
0    January 1, 1996  1996           1.155         1.326
1    January 8, 1996  1996           1.152         1.332
2   January 15, 1996  1996           1.167         1.324
3   January 22, 1996  1996           1.168         1.324
4   January 29, 1996  1996           1.166         1.303
5   February 5, 1996  1996           1.161         1.282
6  February 12, 1996  1996           1.163         1.276
7  February 19, 1996  1996           1.178         1.270
8  February 26, 1996  1996           1.202         1.278
9      March 4, 1996  1996           1.218         1.274

In [6]:
# Check data type of the dataset
df_gd.dtypes

date               object
year                int64
gasoline_price    float64
diesel_price      float64
dtype: object

In [7]:
# Describe the dataset
df_gd.describe()

              year  gasoline_price  diesel_price
count  1380.000000     1380.000000   1380.000000
mean   2008.718841        2.740583      2.842578
std       7.640058        1.024916      1.134286
min    1996.000000        1.074000      1.097000
25%    2002.000000        1.710750      1.617750
50%    2009.000000        2.911000      2.925000
75%    2015.000000        3.547750      3.899500
max    2022.000000        6.178000      6.831000